## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_search_service.srch will be created
  + resource "azurerm_search_service" "srch" {
      + customer_managed_key_enforcement_enabled = false
      + hosting_mode                             = "default"
      + id                                       = (known after apply)
      + local_authentication_enabled             = true
      + location                                 = "eastus"
      + name                                     = "srch-eastus"
      + partition_count                          = 1
      + primary_key                              = (sensitive value)
      + public_network_access_enabled            = false
      + query_keys                               = (known after apply)
      + replica_count                            = 1
      + resource_group_name                      = "RG-UmeshPagar"
      + secondary_key                            = (sensitive value)
      + sku                                      = "standard"
    }

  # module.virtual_network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/20",
        ]
      + dns_servers         = [
          + "8.8.8.8",
          + "8.8.4.4",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vn-test-prod"
      + resource_group_name = "RG-UmeshPagar"
      + subnet              = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
                # (1 unchanged attribute hidden)
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "subnet2"
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "created_by"  = "Terraform"
          + "environment" = "prod"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rg_name             = "RG-UmeshPagar"
  + search_service_id   = (known after apply)
  + search_service_name = "srch-eastus"
```
</details>